document.querySelector('button').onclick = myClick;

function myClick() {
let a1 = document.querySelector('.a1').value;
let a2 = document.querySelector('.a2').value;
let b1 = document.querySelector('.b1').value;
let b2 = document.querySelector('.b2').value;
let c1 = document.querySelector('.c1').value;
let c2 = document.querySelector('.c2').value;
let ans1 = Number(a1) + Number(b1) - Number(c1);
let out1 = `${a1} + ${b1} - ${c1} = ${ans1}  (масса)`
let ans2 = Number(a2) + Number(b2) - Number(c2);
let out2 = `${a2} + ${b1} - ${c2} = ${ans2} - порядковый номер`
let elements = ["n","H (водород)","He (гелий)","Li (литий)","Be (бериллий)","B (бор)","C (углерод)","N (азот)","О (кислород)","F (фтор)","Ne (неон)","Na (натрий)","Mg (магний)","Al (алюминий)","Si (кремний)","Р (фосфор)","S (сера)","Cl (хлор)","Ar (аргон)","Ka (калий)","Ca (кальций)","Sc (скандий)","Ti (титан)","V (ванадий)","Cr (хром)","Mn (марганец)","Fe (железо)","Со (кобальт)","Ni (никель)","Cu (медь)","Zn (цинк)","Ga (галлий)","Ge (германий)","As (мышьяк)","Se (селен)","Br (бром)","Kr (криптон)","Rb (рубидий)","Sr (стронций)","Y (итрий)","Zr (цирконий)","Nb (ниобий)","Mo (молибден)","Tc (технеций)","Ru (рутений)","Rh (родий)","Pd (палладий)","Ag (серебро)","Cd (кадмий)","In (индий)","Sn (олово)","Sb (сурьма)","Te (теллур)","I (йод)","Xe (ксенон)","Cs (цезий)","Ba (барий)","La (лантан)","Ce (церий)","Pr (празеодим)","Nd (неодим)","Pm (прометий)","Sm (самарий)","Eu (европий)","Gd (гадолиний)","Tb (тербий)","Dy (диспрозий)","Ho (гольмий)","Er (эрбий)","Tm (тулий)","Yb (иттербий)","Lu (лютерций)","Hf (гафний)","Ta (тантал)","W (вольфрам)","Re (рений)","Os (осмий)","Ir (иридий)","Pt (платина)","Au (золото)","Hg (ртуть)","Tl (таллий)","Pb (свинец)","Bi (бисмут)","Po (полоний)","At (астат)","Rn (радон)","Fr (франций)","Ra (радий)","Ac (актиний)","Th (торий)","Pa (протактиний)","U (уран)","Np (нептуний)","Pu (плутоний)","Am (амерций)","Cm (кюрий)","Bk (берклий)","Cf (калифорний)","Es (эйнштейней)","Fm (фермий)","Md (менделевий)","No (нобелий)","Lo (лоуренсий)","Rf (резерфордий)","Db (дубний)","Sg (сиборгий)","Bh (борий)","Hs (хассий)","Mt (майтнерий)","Ds (дармштадтий)","Rg (рентгений)","Cn (конперниций)","Nh (нихоний)","Fl (флеровий)","Mc (московий)","Lv (ливерморий)","Ts (тесннессин)","Og (оганесон)"]
let out3 = "Ответ: " + elements [ans2] + "; (масса = " + ans1 + " а.е.м.; порядковый номер - " + ans2 + ")"
document.querySelector('.out1').innerHTML = out1;
document.querySelector('.out2').innerHTML = out2;
document.querySelector('.out3').innerHTML = out3;   
}